# Pandas

In [2]:
import pandas as pd
import numpy as np

## Series class

In [3]:
# Series 객체를 생성할 때 pd.Series()

series = pd.Series(['하나', '둘', '셋', '넷', '다섯'],
                    index = [ _ for _ in range(1,6)])

series

1    하나
2     둘
3     셋
4     넷
5    다섯
dtype: object

In [4]:
#10에서 90까지 값을 갖는 Series 생성
#rangeIndex 사용

s = pd.Series([ _ for _ in range(10,100,10)])
s

# pd.Series(list(range(10,100,10)))  <이렇게합시다...:)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [5]:
# 각 도시의 2015년 인구 데이터를 series로 만들기~
# 읽기 쉽게 하기 위해 콤마로 3자리씩 끊어 표기하는 법 _로!

s = pd.Series( [9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index=['서울', '부산', '인천', '대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [6]:
pd.Series(range(10,14))

#index와 value의 개수는 동일해야 함.
#index를 지정하지 않으면 0부터 시작하는 정수 값(rangeIndex)

0    10
1    11
2    12
3    13
dtype: int64

In [8]:
# 앞서 만든 연습문제의 Series 객체의 값 중 50보다 큰 값의 개수

print(s.values)
sum(s.values[:]>50) # 50보다 큰 값을 시리즈에서 하나씩 읽어옴 -> True, False

[9904312 3448737 2890451 2466052]

4

In [8]:
d = {'a':1, 'b':2, 'c':3}
ser = pd.Series(data=d, index=['c','a','b'])  #index 순서대로 딕셔너리 위치 바뀜
                                        #딕셔너리는 순서가 없는 데이터(비시퀀스)
print(ser)

ser2 = pd.Series(data=d, index=['c','a','b1']) #없는 키를 입력하면 
print(ser2)                                    #Nan 값 뜸

c    3
a    1
b    2
dtype: int64
c     3.0
a     1.0
b1    NaN
dtype: float64

In [9]:
#연습문제 이름 index, 점수 values로 하는 series 만들기

score = pd.Series([88,95,100,67],
                  index=['철수','영희','길동','몽룡'])
score

철수     88
영희     95
길동    100
몽룡     67
dtype: int64

In [10]:
#index를 속성처럼 활용하기
print(score.철수)

score.철수, score.영희, score.몽룡

#가능합니다.

88

(88, 95, 67)

In [11]:
ser.a

1

In [12]:
#index label을 키(key)로 사용하므로
#딕셔너리처럼 in, items() method 사용하며 요소의 키, 값에 접근 가능

print('서울' in s, '\n')

for k, v in s.items():
    print(f'{k}, {v}')

True

서울, 9904312
부산, 3448737
인천, 2890451
대구, 2466052

In [13]:
test = dict( zip(range(10), list('영일이삼사오육칠팔구')) )
            #zip으로 dict에 키, 값을 넣어줌

for k, v in test.items():
    print(f'{k}, {v}')    #하나씩 꺼내줍니다
    
print('\n')
print('영 in test.values(): ', '영' in test.values())
print('서울 in s: ', '서울' in s)

0, 영
1, 일
2, 이
3, 삼
4, 사
5, 오
6, 육
7, 칠
8, 팔
9, 구


영 in test.values():  True
서울 in s:  True

In [14]:
pop = pd.Series( [9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index=['서울', '부산', '인천', '대구'])
#population
#도시의 인구가 300만이 넘는 곳을 찾아 다음과 같이 출력해보세요.
# 서울의 인구는 300만이 넘습니다.
# for, items() 사용

for a, b in pop.items():
    if b>=3000000:
        print(f'{a}의 인구는 300만이 넘습니다.')

서울의 인구는 300만이 넘습니다.
부산의 인구는 300만이 넘습니다.

In [15]:
print(pop['서울'], pop[0], '\n')
print(pop[[2, 3, 1]], '\n')
print(pop[['대구', '부산']], '\n')
#pop.0은 안 됨
print(pop.서울)

9904312 9904312

인천    2890451
대구    2466052
부산    3448737
dtype: int64

대구    2466052
부산    3448737
dtype: int64

9904312

In [16]:
#인천의 인덱스와 값을 시리즈로 조회해보세요.
pop[['인천']]

인천    2890451
dtype: int64

In [17]:
print(pop,'\n')
print(pop[1:3], '\n')
print(pop['부산':'대구'])

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

부산    3448737
인천    2890451
dtype: int64

부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [18]:
#2015년도 인구, 2010년도 인구 비교(증감)
#근데 이제 대구 대신 대전을 포함한
pop15 = pop
pop10 = pd.Series({'서울':9631482, '부산':3393191, '인천':2632035, '대전':1490158})

popM = pop15-pop10

#계산이 불가능한 데이터는 NaN(Not a Number) 값을 가짐

In [19]:
popM.isnull()
#NaN -> True null 값입니다.
#값 있으면 False

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [20]:
popM.notnull()
#반대~

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [21]:
#NaN이 아닌 값만 인덱싱으로 구하기

print( popM[ popM.isnull() ], '\n' )
print( popM[ popM.notnull() ], '\n' )

print(pop[ pop>3000000 ] )

대구   NaN
대전   NaN
dtype: float64

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

서울    9904312
부산    3448737
dtype: int64

In [22]:
#Nan 값을 배제하고 2010년 대비 2015년의 인구 증가율 구하기

popP = (pop15 - pop10) / pop10 * 100
popP = popP[ popP.notnull() ]    #notnull true인 값만 popP에 추가~
popP

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [23]:
#2010년 대비 2015년 증가량 구하기(NaN값 배제)
#인구수 증가가 가장 많은 도시의 이름과 증가한 인구수를 series 객체로 출력

popPlus = pop15 - pop10
popPlus = popPlus[ popPlus.notnull() ]
popPlus[ popPlus == popPlus.max() ]

서울    272830.0
dtype: float64

In [24]:
#강사님 답변
popPlus = pop15 - pop10
popPlus = popPlus[ popPlus.notnull() ]
popPlus[[popPlus.values.argmax()]]

서울    272830.0
dtype: float64

In [25]:
#갱신
popP.서울 = 2.83
popP['인천'] = 9.82

popP['부산':'서울'] = 1.63, 2.83
popP['울산'] = 1.03
del popP['서울']

popP

부산    1.63
인천    9.82
울산    1.03
dtype: float64

In [26]:
popM.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [27]:
fin1 = {'카카오': 60010, '삼성전자': 61000, 'LG전자': 90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ['카카오', '삼성전자', '네이버']

ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value, index = fin2_index )

ser_finance1

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64

In [28]:
ser_finance2

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [29]:
ser_finance1 - ser_finance2

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [30]:
ser_finance1 + ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [31]:
ser_finance1 * ser_finance2

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [32]:
ser_finance1 / ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [41]:
result = ser_finance1 - ser_finance2
result[result.notnull()]    #nan 값 빼고 저장하기

삼성전자   -200.0
카카오    -190.0
dtype: float64

In [ ]:
pd.DataFrame( data=None, index:'key'=None)

In [42]:
d = {'col1' : [1, 2], 'col2': [3,4] }  #열 이름이 key, 값들이 value
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [43]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" :[0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [45]:
# dataFrame 자료형 확인
# 각 열 별로 자료형이 다를 수 있다.
df.dtypes #dtype이 아닌 dtypes!

지역                object
2015               int64
2010               int64
2005               int64
2000               int64
2010-2015 증가율    float64
dtype: object

In [46]:
print(df.values, '\n')
print(df.columns, '\n')
df.index

[['수도권' 9904312 9631482 9762546 9853972 0.0283]
 ['경상권' 3448737 3393191 3512547 3655437 0.0163]
 ['수도권' 2890451 2632035 2517680 2466338 0.0982]
 ['경상권' 2466052 2431774 2456016 2473990 0.0141]]

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [50]:
df.index.name = '도시'    #행이름의 그룹이름 
df.columns.name = '특성'  #열이름의 그룹이름

In [49]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [66]:
data = {
    "Special Color":['Midnight Green','Pacific Blue', 'Alpine Green', 'Deep Purple' ],
    "Display Size":[5.8, 6.1, 6.1, 6.1 ],
    "Running Time":[18, 17, 22, 23 ],
    "Bionic Chip": ['A13', 'A14', 'A15', 'A16' ]
}

index = ['iPhone11Pro', 'iPhone12Pro', 'iPhone13Pro', 'iPhone14Pro']

iPhone = pd.DataFrame(data = data, index = index)
iPhone.columns.name = 'Summary'
iPhone

Summary       Special Color  Display Size  Running Time Bionic Chip
iPhone11Pro  Midnight Green           5.8            18         A13
iPhone12Pro    Pacific Blue           6.1            17         A14
iPhone13Pro    Alpine Green           6.1            22         A15
iPhone14Pro     Deep Purple           6.1            23         A16

In [53]:
iPhone.dtypes

Summary
Special Color     object
Display Size     float64
Running Time       int64
Bionic Chip       object
dtype: object

In [58]:
#주현주현 왜 나랑 안 노라죠
#나랑 노라죠
#공부 하지뭬
#난 내일 늦게 와
#한번 상담사분깨 물어볼게
#히히히히히히히

In [67]:
# dataFrame 추가, 갱신, 삭제

# 열 추가 ( inch *25.4 = mm )
iPhone ['Display Size(mm)'] = iPhone['Display Size']*25.4

In [68]:
# 열 갱신
# iPhone['Display Size'] = ['5.8 inch', '6.1 inch', '6.1 inch', '6.1 inch']

del iPhone['Bionic Chip']

In [69]:
iPhone

Summary       Special Color  Display Size  Running Time  Display Size(mm)
iPhone11Pro  Midnight Green           5.8            18            147.32
iPhone12Pro    Pacific Blue           6.1            17            154.94
iPhone13Pro    Alpine Green           6.1            22            154.94
iPhone14Pro     Deep Purple           6.1            23            154.94

In [79]:
#열 다시 추가
iPhone["Bionic Chip"] = ['A13', 'A14', 'A15', 'A16' ]  #같은 문자열

In [80]:
iPhone

Summary,Special Color,Display Size,Running Time,Display Size(mm),Bionic Chip
iPhone11Pro,Midnight Green,5.8,18,147.32,A13
iPhone12Pro,Pacific Blue,6.1,17,154.94,A14
iPhone13Pro,Alpine Green,6.1,22,154.94,A15
iPhone14Pro,Deep Purple,6.1,23,154.94,A16

In [81]:
iPhone['Special Color']  # index도 시리즈 객체로 같이 반환된당

iPhone11Pro    Midnight Green
iPhone12Pro      Pacific Blue
iPhone13Pro      Alpine Green
iPhone14Pro       Deep Purple
Name: Special Color, dtype: object

In [85]:
iPhone[['Special Color'] ]  #dataframe 방식으로 반환하기

Summary       Special Color
iPhone11Pro  Midnight Green
iPhone12Pro    Pacific Blue
iPhone13Pro    Alpine Green
iPhone14Pro     Deep Purple

In [ ]:
#문자열 label일 때는 정수 index사용불가능.
#key Error 발생함

iPhone[0]

#문자열 label 아니고 기본 정수형 column index를 가지는 경우에는 index 값으로 정수 사용 가능

In [88]:
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
print(df2, '\n')
print(df2[2])

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

0     2
1     6
2    10
Name: 2, dtype: int32

In [90]:
#iPhone['iPhone13Pro'] row 단위로 인덱싱 못 함.
#column으로 먼저 접근 후 row로 도려내기는 가능
iPhone['Special Color']['iPhone13Pro']
# 나중에 나오는 at을 더 많이 사용함

'Alpine Green'

In [92]:
#연습문제

data = {
    '국어': [80,90,70,30],
    '영어': [90,70,60,40],
    '수학': [90,60,80,70]
}
columns = ['국어', '영어', '수학']
index = ['춘향', '몽룡', '향단', '방자']
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [112]:
# 1) 모든 학생의 수학 점수를 Series
pd.Series(df['수학'])

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [ ]:
# 2) 모든 학생의 국어와 영어점수를 데이터 프레임
df[['국어','영어']]

In [103]:
#3) 모든 학생, 각 과목 평균 점수를 새로운 열로 추가
avg =[]

for i in index:
    sumv = 0
    for c in columns:
        sumv += df[c][i]
    avg.append(sumv/3)
df['평균점수'] = avg
df

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [128]:
df['평균'] = round((df['국어']+df['영어']+df['수학'])/3, 2)
df

    국어  영어  수학       평균점수     평균
춘향  80  90  90  86.666667  86.67
몽룡  90  70  60  73.333333  73.33
향단  70  60  80  70.000000  70.00
방자  30  40  70  46.666667  46.67

In [122]:
# 4) 춘향의 점수를 DataFrame
ch = pd.DataFrame(data = [df['국어']['춘향'], df['영어']['춘향'], df['수학']['춘향']],
                  index = columns, columns = ['춘향의 점수'] )

#ch = pd.DataFrame(data=df[[df[_]['춘향'] for _ in columns]], columns = ['춘향의 점수'] )
ch

    춘향의 점수
국어      80
영어      90
수학      90

In [126]:
df.T[['춘향']] #전치 (Transpose)

             춘향
국어    80.000000
영어    90.000000
수학    90.000000
평균점수  86.666667

In [130]:
df[:1] #df['춘향':'춘향']

    국어  영어  수학       평균점수     평균
춘향  80  90  90  86.666667  86.67

In [114]:
# 5) 향단의 점수를 Series
pd.Series( [df[_]['향단'] for _ in columns])

0    70
1    60
2    80
dtype: int64

In [127]:
pd.Series( df.T['향단'] )  #전치 (Transpose)

국어      70.0
영어      60.0
수학      80.0
평균점수    70.0
Name: 향단, dtype: float64

In [133]:
df.T['향단'] #Series로 감싸지 않아도 됨 column에 대한 반환값은 자동으로 시리즈~!

국어      70.0
영어      60.0
수학      80.0
평균점수    70.0
평균      70.0
Name: 향단, dtype: float64

In [ ]:
# df.loc[index] 로 향단이 가져오면 됨

In [156]:
#연습문제
#다음 DataFrame을 만들어 보세요
"""
- 랜덤 시드는 0입니다.
- values는 넘파이 서브 패키지 중 random의 randn() 메서드를 사용하세요.
- index는 pd.date_range("20130226", periods=날짜수)을 활용하세요.
"""

import numpy as np
np.random.seed(0)

index = pd.date_range("20130226", periods=6)

pd.DataFrame( data = np.random.randn(24).reshape(6, 4),
             index = index, columns = ['A', 'B', 'C', 'D'] )

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165

In [9]:
"""
230307 수업
"""

import pandas as pd
import numpy as np

In [10]:
#Series의 값이 많은 경우

nums = pd.Series(range(500))
nums

"""
앞 5개, 뒤 5개 출력해 줌
많은 데이터를 한번에 출력하면 주피터 자체가 느려질 수 있기 때문
"""

'\n앞 5개, 뒤 5개 출력해 줌\n많은 데이터를 한번에 출력하면 주피터 자체가 느려질 수 있기 때문\n'

In [5]:
#series head 메서드
#데이터를 앞에 n개 출력해 볼 수 있는 메서드
nums.head(10)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [6]:
#series tail 메서드
#데이터를 뒤에 n개 출력해 볼 수 있음

nums.tail(10)

490    490
491    491
492    492
493    493
494    494
495    495
496    496
497    497
498    498
499    499
dtype: int64

In [11]:
nums = pd.Series ( [1, 2, np.nan, 4, 5] )
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [13]:
hello = pd.Series(list('hello'))
hello

0    h
1    e
2    l
3    l
4    o
dtype: object

In [15]:
#unique한 값의 개수를 반환
hello.nunique()

4

In [16]:
#데이터의 개수를 반환
nums.count()

4

In [18]:
somechar = pd.Series(list("AaBbCc"))
somechar

0    A
1    a
2    B
3    b
4    C
5    c
dtype: object

In [21]:
#하나의 문자를 unicode 숫자로 변경해주는 ord()
ord('a')

97

In [22]:
#수학연산 describe() 메서드
nums.describe()

count    4.000000
mean     3.000000
std      1.825742
min      1.000000
25%      1.750000
50%      3.000000
75%      4.250000
max      5.000000
dtype: float64

In [23]:
superheros = [
    "Batman",
    "Superman",
     "Spider-Man",
     "Iron Man",
     "Captain America",
     "Wonder Woman"
]
strength_levels = (100, 120, 90, 95, 110, 120)

In [25]:
"""
연습문제!!
"""

'\n연습문제!!\n'

In [72]:
#csv 데이터 읽어오기

pokemons = pd.read_csv ("C:\python\datas\pokemon.csv", index_col="Pokemon", squeeze=True)

C:\Users\user\AppData\Local\Temp\ipykernel_9480\3037897865.py:3: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  pokemons = pd.read_csv ("C:\python\datas\pokemon.csv", index_col="Pokemon", squeeze=True)

In [7]:
pokemons

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

In [8]:
pokemons.describe()

count        809
unique       159
top       Normal
freq          65
Name: Type, dtype: object

In [12]:
pokemons.sort_values(ascending = False)    #값 내림차순 정렬

Pokemon
Empoleon      Water / Steel
Corsola        Water / Rock
Relicanth      Water / Rock
Carracosta     Water / Rock
Tirtouga       Water / Rock
                  ...
Kricketune              Bug
Cascoon                 Bug
Scatterbug              Bug
Kricketot               Bug
Grubbin                 Bug
Name: Type, Length: 809, dtype: object

In [1]:
google = pd.read_csv("C:\python\datas\google_stocks.csv", parse_dates=["Date"],
                     index_col="Date", squeeze=True)
google

NameError: name 'pd' is not defined

In [75]:
war = pd.read_csv('C:\\python\\datas\\revolutionary_war.csv', parse_dates=['Start Date'],
                  index_col='Start Date', usecols=['Start Date', 'State'],
                  squeeze=True
                 )
war

C:\Users\user\AppData\Local\Temp\ipykernel_9480\2069280567.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  war = pd.read_csv('C:\\python\\datas\\revolutionary_war.csv', parse_dates=['Start Date'],

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [76]:
"""



슬라이드 47page까지!




"""

'\n\n\n\n슬라이드 47page까지!\n\n\n\n\n'

In [21]:
google.nlargest(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [23]:
"""
Series 내 데이터의 고유한 값의 빈도를 볼 때 활용
값의 내림차순으로 (빈도) 정렬됨
"""

pokemons.value_counts()

Normal                65
Water                 61
Grass                 38
Psychic               35
Fire                  30
                      ..
Fire / Psychic         1
Normal / Ground        1
Psychic / Fighting     1
Dark / Ghost           1
Fire / Ghost           1
Name: Type, Length: 159, dtype: int64

In [26]:
#            ↑와 같은 값 나옴
len(pokemons.value_counts())

159

In [28]:
google.describe()

#min        49.820000
#max      1287.580000

count    3824.000000
mean      479.945860
std       328.528592
min        49.820000
25%       235.860000
50%       314.680000
75%       708.205000
max      1287.580000
Name: Close, dtype: float64

In [31]:
bins = np.linspace(0, 1400, 8)
bins   # 이걸로 슬라이싱해줄거임 인위적으로 범위 만든겨

array([   0.,  200.,  400.,  600.,  800., 1000., 1200., 1400.])

In [34]:
google.value_counts(bins=bins)

#(0, 200] 0초과 200이하, (200, 400]... 범위에 포함되는 값의 개수를
#세어서 자동으로 값의 내림차순으로 정렬

(200.0, 400.0]      1568
(-0.001, 200.0]      595
(400.0, 600.0]       575
(1000.0, 1200.0]     406
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [44]:
"""
연습문제
- google 변수가 가리키는 Series 객체에 대해
[0, 200, 400, 600, 800, 1000, 1200, 1400]의 구간을 갖는 값의 개수를 구하고
인덱스 순으로 정렬
"""

google.value_counts(bins=range(0,1401,200)).sort_index(na_position="first")
#                                         , sort=False) 해주면 sort 풀림
#                          미입력 시 기본값 sort =True

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [45]:
#bins 에 정수로 전달하면 알아서 정수만큼의 구간으로 나누어줌
google.value_counts(bins=8, sort=False)

(48.581, 204.54]       651
(204.54, 359.26]      1435
(359.26, 513.98]       263
(513.98, 668.7]        466
(668.7, 823.42]        334
(823.42, 978.14]       161
(978.14, 1132.86]      283
(1132.86, 1287.58]     231
Name: Close, dtype: int64

In [54]:
#pandas 데이터 csv로 출력하기

columns = ['c1', 'c2', 'c3']
df_csv = pd.DataFrame([[1, 2, '누락'],
              [1.11, '', 3.33],
              ['one', 'two', 'three']],index=columns).T
df_csv

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [56]:
"""
데이터를 csv 파일로 출력할 때 to_csv() 메서드 활용
index=True 기본값인데 현재 만든 dataframe에서는 index가 필요없으므로 false로 해보겟읍니다
"""

df_csv.to_csv('datas/sample1.csv', index=False)

In [63]:
#딕셔너리는 키값 기준으로 열 추가됨
d = { 'c1' :[1, 2, 3], 'c2':[4, 5, 6] }
print(pd.DataFrame(d))

#리스트는 행으로 쌓임...
pd.DataFrame(
    data = [[1,2,3], [4,5,6]],
    columns = ['c1', 'c2', 'c3']
)

   c1  c2
0   1   4
1   2   5
2   3   6

   c1  c2  c3
0   1   2   3
1   4   5   6

In [71]:
%pwd

#지금 어디서 동작하고 있는지 위치 뜸

'C:\\python'

In [70]:
%cd C:\\python

# 현재 경로 바꿔줌

C:\python

In [77]:
%cd C:\\python\datas
df_read = pd.read_csv('sample1.csv')
df_read

C:\python\datas

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [79]:
df_csv.to_csv('sample2.csv', index=False, header=False)
#인덱스 없이:)

In [81]:
pd.read_csv('sample2.csv', names=['c1', 'c2', 'c3'])

#불러올 때 header 만들어 줌 (열 이름)

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [88]:
%%writefile sample3.txt
c1       c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

In [89]:
# 위는 jupyterlab 자체 기능

In [91]:
        # 길이가 정해지지 않은 공백이 구분자인 경우
        #                       space + 정규식 문자열 사용
pd.read_table('sample3.txt', sep='\s+' )

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [92]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [93]:
#앞 두 줄을 skip 하겠다는 뜻
pd.read_csv('sample4.txt', skiprows=[0, 1] )

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [95]:
#자료 안 특정 값을 NaN으로 취급하고 싶으면 na_values 인수에 NaN으로 취급할 값을 넣기

df_na_val = pd.read_csv('sample1.csv', na_values=['누락'] )
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [98]:
# 구분자 바꿔서 넣어봅쉬다
# | vertical bar

df_na_val.to_csv('sample5.txt', sep = '|' )

#to_csv 지만 .txt로 지정해주면 txt로 저장된다

In [99]:
#불러올 때와 마찬가지로 저장할 때도
#na_rep 키워드 인수를 사용해서 NaN 값을 바꿀 수 있다.
df_na_val.to_csv('sample6.csv', na_rep='누락')

In [104]:
#유명한 데이터인데 불러와볼게용.
""" 온라인 csv 파일 가져오기 """

titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [101]:
titanic.describe()

         survived         age  n_siblings_spouses       parch        fare
count  627.000000  627.000000          627.000000  627.000000  627.000000
mean     0.387560   29.631308            0.545455    0.379585   34.385399
std      0.487582   12.511818            1.151090    0.792999   54.597730
min      0.000000    0.750000            0.000000    0.000000    0.000000
25%      0.000000   23.000000            0.000000    0.000000    7.895800
50%      0.000000   28.000000            0.000000    0.000000   15.045800
75%      1.000000   35.000000            1.000000    0.000000   31.387500
max      1.000000   80.000000            8.000000    5.000000  512.329200

In [102]:
titanic.head(5)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y

In [103]:
titanic.tail(10)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
617,1,female,15.0,0,0,7.2250,Third,unknown,Cherbourg,y
618,0,male,20.0,0,0,9.8458,Third,unknown,Southampton,y
619,0,male,19.0,0,0,7.8958,Third,unknown,Southampton,y
620,0,male,28.0,0,0,7.8958,Third,unknown,Southampton,y
621,0,female,22.0,0,0,10.5167,Third,unknown,Southampton,y
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [112]:
# 저도 온라인 csv 파일 가져올게용

cities = pd.read_csv('공공데이터활용지원센터_공공데이터포털 목록개방현황_20230228.csv', encoding='cp949')

C:\Users\user\AppData\Local\Temp\ipykernel_9480\306811262.py:3: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  cities = pd.read_csv('공공데이터활용지원센터_공공데이터포털 목록개방현황_20230228.csv', encoding='cp949')

In [ ]:
cities

In [116]:
cities.describe()

                목록키
count  6.861000e+04
mean   1.377254e+07
std    3.746398e+06
min    2.140252e+06
25%    1.504309e+07
50%    1.506672e+07
75%    1.509113e+07
max    1.511255e+07

In [117]:
covid19 = pd.read_csv('COVID 19 Containment measures data.csv')

In [118]:
covid19

,ID,Applies To,Country,Date Start,Date end intended,Description of measure implemented,Exceptions,Implementing City,Implementing State/Province,Keywords,Quantity,Source,Target city,Target country,Target region,Target state
0,163,NaN,Austria,"Mar 16, 2020",NaN,On 10 March 2020 government announced that all...,NaN,NaN,NaN,university closure,NaN,https://en.wikipedia.org/wiki/2020_coronavirus...,NaN,NaN,NaN,NaN
1,132,NaN,Germany,"Feb 01, 2020",NaN,"102 German citizens and 26 relatives, all of w...",NaN,NaN,NaN,international traveller quarantine - risk coun...,0.0001,https://www.tagesschau.de/inland/coronavirus-g...,NaN,NaN,NaN,NaN
2,578,NaN,United Kingdom,"Mar 20, 2020",NaN,"All schools, nurseries and colleges closed.",NaN,NaN,NaN,"nursery school closure, school closure, univer...",NaN,https://www.theguardian.com/world/2020/mar/18/...,NaN,NaN,NaN,NaN
3,372,NaN,United Kingdom,"Mar 16, 2020",NaN,If one person in any household has a persisten...,NaN,NaN,NaN,blanket isolation - symptoms,NaN,https://www.bbc.com/news/uk-51920444,NaN,NaN,NaN,NaN
4,357,NaN,United Kingdom,"Mar 16, 2020",NaN,"By the weekend, those with the most serious he...",NaN,NaN,NaN,isolation advice to elderly,NaN,https://www.bbc.com/news/uk-51920444,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1698,NaN,NaN,US:Louisiana,"Mar 11, 2020",NaN,public health emergency declared,NaN,NaN,NaN,state of emergency,NaN,https://gov.louisiana.gov/assets/Proclamations...,NaN,NaN,NaN,NaN
1699,NaN,NaN,US:Louisiana,"Mar 13, 2020",NaN,all gatherings of 250 people or more postponed...,NaN,NaN,NaN,"indoor gatherings banned, outdoor gatherings b...",250.0000,https://gov.louisiana.gov/assets/Proclamations...,NaN,NaN,NaN,NaN
1700,NaN,NaN,US:Louisiana,"Mar 13, 2020",NaN,closure of all K-12 public schools; all Cathol...,NaN,NaN,NaN,school closure,NaN,https://gov.louisiana.gov/assets/Proclamations...,NaN,NaN,NaN,NaN
1701,NaN,NaN,US:Louisiana,"Mar 13, 2020",NaN,all Louisiana elections postponed,NaN,NaN,NaN,very large event cancellation or postponement,NaN,https://en.wikipedia.org/wiki/2020_coronavirus...,NaN,NaN,NaN,NaN
1702,NaN,NaN,US:Louisiana,"Mar 17, 2020",NaN,Jazz Fest 2020 postponed,NaN,NaN,NaN,very large event cancellation or postponement,NaN,https://wgno.com/news/local/jazz-fest-2020-pos...,NaN,NaN,NaN,NaN

In [119]:
%cd C:\\python\

C:\python

In [2]:
# 230308

In [3]:
import numpy as np
import pandas as pd
import seaborn as sns

In [4]:
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [5]:
# survived 0사망 1생존
# pclass 객실 등급
# sibsp 함께 탑승한 형제 및 배우자 수
# parch 함께 탑승한 부모 수
# fare 요금
# embarked 탑승지 이름 앞글자
# class 객실 등급
# who man, woman, child

In [7]:
titanic.head(4)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False

In [8]:
titanic.tail(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [10]:
titanic.nunique()

#survived 살고 죽음의 2가지

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

In [12]:
#NaN이 아닌 값 제외하고 count

titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [14]:
titanic.dtypes #각각의 타입 조회

#category 라는 type?
#class: First, Second, Third 라는 종류만 있음
#데이터를 카테고리화 하고 메모리를 불러오면
# 메모리상으로 효율적일 수 있음.

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [17]:
titanic.sum(numeric_only=True) # 숫자만 합해주세용

# 산 사람이 342명 (산 사람이 1이었으니까)

survived        342.0000
pclass         2057.0000
age           21205.1700
sibsp           466.0000
parch           340.0000
fare          28693.9493
adult_male      537.0000
alone           537.0000
dtype: float64

In [37]:
print(titanic.mean(numeric_only=True),'\n')
print(titanic.std(numeric_only=True),'\n')
print(titanic.max(numeric_only=True),'\n')
print(titanic.min(numeric_only=True),'\n')
print(titanic.median(numeric_only=True))

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

survived       0.486592
pclass         0.836071
age           14.526497
sibsp          1.102743
parch          0.806057
fare          49.693429
adult_male     0.489615
alone          0.489615
dtype: float64

survived             1
pclass               3
age               80.0
sibsp                8
parch                6
fare          512.3292
adult_male        True
alone             True
dtype: object

survived          0
pclass            1
age            0.42
sibsp             0
parch             0
fare            0.0
adult_male    False
alone         False
dtype: object

survived       0.0000
pclass         3.0000
age           28.0000
sibsp          0.0000
parch          0.0000
fare          14.4542
adult_male     1.0000
alone          1.0000
dtype: float64

In [19]:
# 열 인덱싱
titanic[['age', 'fare', 'survived']]

      age     fare  survived
0    22.0   7.2500         0
1    38.0  71.2833         1
2    26.0   7.9250         1
3    35.0  53.1000         1
4    35.0   8.0500         0
..    ...      ...       ...
886  27.0  13.0000         0
887  19.0  30.0000         1
888   NaN  23.4500         0
889  26.0  30.0000         1
890  32.0   7.7500         0

[891 rows x 3 columns]

In [29]:
#행 인덱싱
titanic[['age', 'fare', 'survived']].sum(axis='rows') #row[i] 간의 벡터 연산을 하겠다
                                     #기본값 axis=0

age         21205.1700
fare        28693.9493
survived      342.0000
dtype: float64

In [30]:
titanic[['age', 'fare', 'survived']].sum(axis=1) #1인 경우는 axis=columns
                                    # columns[i] 간의 벡터 연산을 한다

0       29.2500
1      110.2833
2       34.9250
3       89.1000
4       43.0500
         ...
886     40.0000
887     50.0000
888     23.4500
889     57.0000
890     39.7500
Length: 891, dtype: float64

In [35]:
titanic.nlargest(3, columns = ['fare', 'age'])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True

In [36]:
titanic.nsmallest(3, columns = ['fare'])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
179,0,3,male,36.0,0,0,0.0,S,Third,man,True,NaN,Southampton,no,True
263,0,1,male,40.0,0,0,0.0,S,First,man,True,B,Southampton,no,True
271,1,3,male,25.0,0,0,0.0,S,Third,man,True,NaN,Southampton,yes,True

In [39]:
titanic.describe()

#수치형 데이터에 대해서만 값을 반환함

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [40]:
# dataframe column index를 기준으로 절령하기
titanic.sort_index(axis=1, ascending=False)

,who,survived,sibsp,sex,pclass,parch,fare,embarked,embark_town,deck,class,alone,alive,age,adult_male
0,man,0,1,male,3,0,7.2500,S,Southampton,NaN,Third,False,no,22.0,True
1,woman,1,1,female,1,0,71.2833,C,Cherbourg,C,First,False,yes,38.0,False
2,woman,1,0,female,3,0,7.9250,S,Southampton,NaN,Third,True,yes,26.0,False
3,woman,1,1,female,1,0,53.1000,S,Southampton,C,First,False,yes,35.0,False
4,man,0,0,male,3,0,8.0500,S,Southampton,NaN,Third,True,no,35.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,man,0,0,male,2,0,13.0000,S,Southampton,NaN,Second,True,no,27.0,True
887,woman,1,0,female,1,0,30.0000,S,Southampton,B,First,True,yes,19.0,False
888,woman,0,1,female,3,2,23.4500,S,Southampton,NaN,Third,False,no,NaN,False
889,man,1,0,male,1,0,30.0000,C,Cherbourg,C,First,True,yes,26.0,True
890,man,0,0,male,3,0,7.7500,Q,Queenstown,NaN,Third,True,no,32.0,True

In [45]:
# 타이타닉
#import seaborn as sns
#titanic = sns.load_dataset("titanic")

titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [48]:
titanic[['sex']].value_counts()

sex
male      577
female    314
dtype: int64

In [53]:
pd.value_counts(titanic['sex']).sort_values(ascending=False)

male      577
female    314
Name: sex, dtype: int64

In [52]:
pd.value_counts(titanic['age']).sort_values(ascending=False)

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
66.00     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: age, Length: 88, dtype: int64

In [54]:
pd.value_counts(titanic['class']).sort_values(ascending=False)

Third     491
First     216
Second    184
Name: class, dtype: int64

In [55]:
pd.value_counts(titanic['alive']).sort_values(ascending=False)

no     549
yes    342
Name: alive, dtype: int64

In [57]:
titanic['alive'].value_counts().sort_values(ascending=False)

no     549
yes    342
Name: alive, dtype: int64

In [70]:
# DataFrame 고급 인덱싱 loc 인덱서를 위해 DataFrame을 만들어보렵니다

df = pd.DataFrame(data=np.arange(10,22).reshape(3,4),
                  index=['a','b','c'], columns=['A','B','C','D'])

#좋은 방법
df = pd.DataFrame(data=np.arange(10,22).reshape(3,4),
                  index=list('abc'), columns=list('ABCD'))
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [71]:
df.loc['a']

#label에 대해 접근함

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [72]:
df.loc['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [74]:
df['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [76]:
df.A >15

a    False
b    False
c     True
Name: A, dtype: bool

In [79]:
"""
고급 인덱싱, loc 인덱서
callable한 함수를 만들어서 인덱싱하는데 사용할 수 있다.
다음 함수는 A열의 값이 10보다 큰 row만 선택한다.
"""

def select_rows(df, num):
    return df.A>num

select_rows(df, 10) #A열 요소들이 10보다 큰지 확인

a    False
b     True
c     True
Name: A, dtype: bool

In [81]:
df.loc[select_rows(df, 10)]

#def select_rows 함수에서 True 값을 갖는 열을 출력

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [83]:
df.loc['a':'b']

    A   B   C   D
a  10  11  12  13
b  14  15  16  17

In [85]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4,4),
                   columns=list('ABCD'))
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [86]:
df.loc['a','A'] #행, 열

10

In [88]:
df.at['a', 'A'] #속도가 더 빨라용

10

In [89]:
df.loc['b':, 'A']

b    14
c    18
Name: A, dtype: int32

In [96]:
df.loc['a', : ]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [91]:
df.loc[['a','b'],['B','D']]

    B   D
a  11  13
b  15  17

In [94]:
df.loc[['a','c'], ]

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

In [98]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [101]:
print(df.iloc[0,1])
print('\n')
print(df.iloc[:2, 2])
print('\n')
print(df.iloc[0, -2:])
print('\n')
df.iloc[2:3, 1:3]

11


a    12
b    16
Name: C, dtype: int32


C    12
D    13
Name: a, dtype: int32

    B   C
c  19  20

In [102]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [112]:
round( titanic['age'].mean(), 1 )

29.7

In [145]:
titanic['sex']=='female'
titanic['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [156]:
#여자 중에서 나이 평균

round( titanic[titanic['sex']=='female']['age'].mean(), 1)

27.9

In [157]:
#1등실, 여성 승객의 평균 나이
round( titanic[ (titanic['pclass']==1) & (titanic['sex']=='female')]['age'].mean(), 1)

34.6

In [1]:
#apply 메서드

'''
Series의 각 값에 대해 모두 함수를 적용하는 방법
Series 객체의 값에 대해 한 번씩 함수를 호출
함수 호출의 반환 값으로 구성된 새로운 Series 객체를 반환하는 apply()메서드

시퀀스에 여러 함수 적용하기 -> map(function, 시퀀스)
이걸 시리즈에 적용하는게 apply 함수

원래 함수 호출할때는 함수이름() 이렇게 했지만 객체 자체로 넘겨줄때 함수이름만 넘김.
              여기가 func()가 아님
Series.apply(func, convert_dtype=True, args=())
'''

import pandas as pd
import numpy as np

In [10]:
pokemons = pd.read_csv('datas/pokemon.csv', index_col=['Pokemon']).squeeze()

In [11]:
%pwd #여긴 어디

'C:\\python'

In [13]:
pokemons

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

In [16]:
#series apply() 메서드

def single_or_multi(type):
    if '/' in type:    #슬래시 값이 있나요?
        return 'Multi' #True일 때 멀티 능력의 포켓몬
    return 'Single'    #False일 때 단일 능력의 포켓몬

pokemons.apply(single_or_multi)

Pokemon
Bulbasaur       Multi
Ivysaur         Multi
Venusaur        Multi
Charmander     Single
Charmeleon     Single
                ...
Stakataka       Multi
Blacephalon     Multi
Zeraora        Single
Meltan         Single
Melmetal       Single
Name: Type, Length: 809, dtype: object

In [31]:
pokemons.apply(single_or_multi).value_counts()

Multi     405
Single    404
Name: Type, dtype: int64

In [32]:
#DataFrame.apply(func, axis=0)
#axis = 1은 열마다 적용 ( axis = ↓ )

In [34]:
df = pd.DataFrame([[4,9]]*3, columns=['A','B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [40]:
df.apply(np.sqrt) #제곱근 구하기(각 요소마다 적용되는 함수 universal function, ufunc)
#각 요소마다 각각 적용되는 universal function은 축의 방향이 상관 없음
np.sqrt(df) #와 같음

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [41]:
np.sum(df)

A    12
B    27
dtype: int64

In [42]:
df.apply(np.sum, axis='index')

A    12
B    27
dtype: int64

In [43]:
df.apply(np.sum, axis=1)

0    13
1    13
2    13
dtype: int64

In [44]:
df.apply(lambda x:[1,2], axis=0)

   A  B
0  1  1
1  2  2

In [46]:
df.apply(lambda x:[1,2], axis =1) #아~ apply에서 lambda도 함수니까 쓸 수 있구나~

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [47]:
df3 = pd.DataFrame({'A': [1,3,4,3,4],
                    'B': [2,3,1,2,3],
                    'C': [1,5,2,4,4]})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [49]:
df3.apply(pd.value_counts) #각각 개수가 몇 개인지 구해 줌

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [51]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [53]:
#titanic에서 child와 adult를 나눔
# lambda if 사이에 조건식을 쓸 수 있고, 조건이 true일 때 앞 값을 반환, false일 때 뒷값 반환
titanic['adult/child'] = titanic.apply( lambda r: 'adult' if r.age >=20 else 'child',
                                       axis=1)
                        # lambda r: expression
                        # expression 부분이 반환됨
                        # 여기서는 lambda r: if condi else 한 것 뿐
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [68]:
titanic['category1'] = titanic.apply(lambda r: titanic['sex'] #r['sex'] r.sex 라고 해야됨
                                     if r.age>=20 else 'child', axis=1)

ValueError: Columns must be same length as key

In [65]:
def cate1(titanic):
    if titanic['age'] >= 20:
        return titanic['sex']
    return 'child'

titanic['category1'] = titanic.apply(cate1, axis=1)

titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,male

In [66]:
del titanic['category']

In [67]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

In [74]:
#fillna 메서드
#결측치(NaN)를 원하는 값으로 바꿀 수 있는 함수

#DataFrame.fillna(value = None, *, method=None, ...)
                 #* 앞에 오는 애는 키워드해도되고 그냥 해도됨, *뒤는 키워드 함수
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                  columns = list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [71]:
df.fillna('0.0?') #NaN값 귀엽게 만들기

      A     B     C     D
0  0.0?   2.0  0.0?   0.0
1   3.0   4.0  0.0?   1.0
2  0.0?  0.0?  0.0?  0.0?
3  0.0?   3.0  0.0?   4.0

In [73]:
values = {'A':0, 'B':1, 'C':2, 'D':3}
df.fillna(value=values) #column 마다 원하는 값으로 결측치 채우기 가능

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  2.0  3.0
3  0.0  3.0  2.0  4.0

In [77]:
values = {'A':0, 'B':1, 'C':2, 'D':3}
df.fillna(value=values, limit=1) #열 별로 최대 한개씩만 바꾸겟읍니다라는 뜻

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  NaN  1.0
2  NaN  1.0  NaN  3.0
3  NaN  3.0  NaN  4.0

In [82]:
df2 = pd.DataFrame(np.zeros(3,4), columns=list('ABCE')) #D가 아니라 E임!
df.fillna(df2)

#fillna 메서드에 dataframe을 value로 전달해서 nan값을 대체할 수 있음
#column label과 row index가 일치하지 않으면 적용되지 않음

TypeError: Cannot interpret '4' as a data type

In [86]:
titanic[titanic['age'].isna()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,child,child
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,child,child
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,child,child
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,child,child
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,child,child
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,child,child
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False,child,child
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True,child,child
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,child,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child

In [109]:
# age 열에서 빈 값 평균으로 채워넣기

titanic.age = titanic['age'].fillna(round(titanic.age.mean(), 2))

# titanic.fillna({'age': round(titanic['age'].mean(), 1)}, inplace = True)
#                                                          덮어쓰겠다 트루

#titanic.iloc[index_age_is_nan]

#round 소수점 자리 2개

In [113]:
# DataFrame type 바꾸기

df.astype( {'A': 'float32'}).dtypes

A    float32
B    float64
C    float64
D    float64
dtype: object

In [114]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [120]:
%pwd

'C:\\python'

In [13]:
#employee.csv 불러오기

employees = pd.read_csv('datas\employees.csv', parse_dates=['Start Date'])

In [131]:
employees.info()

# Mgmt는 True, False인데 object Dtype으로 나옴.
# 이를 bool type으로 바꾸는게 낫다면 변경해봅시다

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.0+ KB

In [135]:
employees.astype( {'Mgmt': 'bool'}).dtypes

First Name            object
Gender                object
Start Date    datetime64[ns]
Salary               float64
Mgmt                    bool
Team                  object
dtype: object

In [140]:
employees.Mgmt = employees.Mgmt.astype('?')
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    object
dtypes: bool(1), datetime64[ns](1), float64(1), object(3)
memory usage: 40.2+ KB

In [145]:
employees.Salary.isna

<bound method Series.isna of 0            NaN
1        61933.0
2       130590.0
3       138705.0
4       101004.0
          ...
996      42392.0
997      96914.0
998      60500.0
999     129949.0
1000         NaN
Name: Salary, Length: 1001, dtype: float64>

In [147]:
employees.Salary.fillna(0, inplace = True)

In [156]:
sal = employees.Salary

if sum(sal.round(0)==sal) == len(sal):
    sal = sal.astype('int32')

In [172]:
if (employees.Salary - employees.Salary.apply(int))==0:
    employees.Salary = employees.Salary.astype('int32')
employees.Salary.info

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [173]:
employees

     First Name  Gender Start Date    Salary  Mgmt          Team
0       Douglas    Male 1993-08-06       0.0  True     Marketing
1        Thomas    Male 1996-03-31   61933.0  True           NaN
2         Maria  Female        NaT  130590.0  True       Finance
3         Jerry     NaN 2005-03-04  138705.0  True       Finance
4         Larry    Male 1998-01-24  101004.0  True            IT
...         ...     ...        ...       ...   ...           ...
996     Phillip    Male 1984-01-31   42392.0  True       Finance
997     Russell    Male 2013-05-20   96914.0  True       Product
998       Larry    Male 2013-04-20   60500.0  True  Business Dev
999      Albert    Male 2012-05-15  129949.0  True         Sales
1000        NaN     NaN        NaT       0.0  True           NaN

[1001 rows x 6 columns]

In [179]:
employees.Team = employees.Team.astype('category')
employees.Team.value_counts()

IT              106
Finance         102
Business Dev    101
Marketing        98
Product          95
Sales            94
Engineering      92
HR               91
Distribution     90
Legal            88
Name: Team, dtype: int64

In [184]:
employees[['Team','Gender']] = employees[['Team','Gender']].astype('category')

In [187]:
employees.dtypes

First Name            object
Gender              category
Start Date    datetime64[ns]
Salary               float64
Mgmt                    bool
Team                category
dtype: object

In [189]:
titanic.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
adult/child      object
category1        object
dtype: object

In [195]:
titanic.category2 = titanic.sex + titanic.age.astype('str')
titanic.category2

0        male22.0
1      female38.0
2      female26.0
3      female35.0
4        male35.0
          ...
886      male27.0
887    female19.0
888    female29.7
889      male26.0
890      male32.0
Length: 891, dtype: object

In [198]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [199]:
# DataFrame 실수 값ㅇ르 카테고리 값으로 변환
#범주를 만들어서 이름 붙여주기~
#      [ )[  )[  )[  )[  )[   ]
bins = [1, 20, 30, 50, 70, 100]
labels = ['미성년자', '청년', '장년', '중년', '노년']
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '중년', '미성년자', '장년', '장년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '장년' < '중년' < '노년']

In [200]:
#cut()이 반환하는 값은 categorical 클래스 객체
type(cats)

pandas.core.arrays.categorical.Categorical

In [201]:
cats.categories

Index(['미성년자', '청년', '장년', '중년', '노년'], dtype='object')

In [202]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [204]:
#data frame 실수 값을 카테고리 값으로 변환
df4 = pd.DataFrame(ages, columns=['ages'])
df4['age_cat'] = pd.cut(df4.ages, bins, labels= labels)
df4

#포함되지 않는 것은 NaN~

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      장년
7     61      중년
8     20    미성년자
9     41      장년
10    32      장년
11   101     NaN

In [205]:
#문자열 처럼 쓰고 싶으면 type을 변경해야한다.
df4['age_cat'].astype(str) + df4.ages.astype(str)

0       nan0
1      미성년자2
2     미성년자10
3       청년21
4       청년23
5       장년37
6       장년31
7       중년61
8     미성년자20
9       장년41
10      장년32
11    nan101
dtype: object

In [208]:
"""qcut 4구간으로 나눈다!."""

data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels = ['Q1', 'Q2', 'Q3', 'Q4'])
cats.value_counts()

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64

In [209]:
cats

['Q4', 'Q2', 'Q2', 'Q1', 'Q4', ..., 'Q2', 'Q2', 'Q4', 'Q1', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [211]:
bins = [1, 20, 30, 50, 70, 100]
labels = ['미성년자', '청년', '장년', '중년', '노년']

pd.cut(titanic.age, bins, labels = labels).value_counts()

청년      407
장년      241
미성년자    165
중년       59
노년        5
Name: age, dtype: int64

In [227]:
# value counts 에서 normalize = True  하면 비율을 구해줌...
titanicAgeCut = pd.cut(titanic.age, bins, labels = labels)
titanicAgeCut.value_counts()

청년      407
장년      241
미성년자    165
중년       59
노년        5
Name: age, dtype: int64

In [232]:
titanic['category2'] = pd.cut(titanic.age, bins, labels = labels)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male,청년
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female,장년
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female,청년
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female,장년
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male,장년
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male,청년
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child,미성년자
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child,청년
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male,청년
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,장년

In [223]:
print(round(titanicAgeCut*100, 2))

청년      46.41
장년      27.48
미성년자    18.81
중년       6.73
노년       0.57
Name: age, dtype: float64

In [242]:
titanic['category3'] = titanic[['age']].apply(
    lambda a: titanic.category2 + titanic.sex(lambda s: '남성' if s=='male' else '여성')
    if a>=20 else '미성년자'
)
titanic

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [233]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male,청년
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female,장년
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female,청년
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female,장년
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male,장년
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male,청년
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child,미성년자
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child,청년
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male,청년
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,장년

In [245]:
def cat3(a):
    if a>=20:
        if titanic.sex == 'male':
            sex = '남성'
        else: sex = '여성'
        return titanic.category2 + sex
    else:
        return '미성년자'

In [252]:
titanic['category3'] = titanic.apply(cat3([titanic['age']]))

TypeError: '>=' not supported between instances of 'list' and 'int'

In [249]:
cat3([[titanic.age]])

TypeError: '>=' not supported between instances of 'list' and 'int'

In [251]:
#강사님 답변

titanic['age'].fillna(titanic['age'].mean(), inplace= True)
bins = [1, 20, 30, 50, 70, 100]
labels = ['미성년자', '청년', '장년', '중년', '노년']

titanic['연령층'] = pd.cut(titanic.age, bins=bins, labels = labels)
titanic['category3'] = titanic.apply(lambda i : '미성년자' if i['age'] <20 else i['연령층']
                                     + ('남성' if i['sex'] == 'male' else '여성'), axis =1)
titanic[['연령층', 'age', 'sex', 'category3']]

      연령층   age     sex category3
0      청년  22.0    male      청년남성
1      장년  38.0  female      장년여성
2      청년  26.0  female      청년여성
3      장년  35.0  female      장년여성
4      장년  35.0    male      장년남성
..    ...   ...     ...       ...
886    청년  27.0    male      청년남성
887  미성년자  19.0  female      미성년자
888    청년  29.7  female      청년여성
889    청년  26.0    male      청년남성
890    장년  32.0    male      장년남성

[891 rows x 4 columns]

In [ ]:
#230310

In [2]:
import numpy as np
import pandas as pd

In [7]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns = ['C1', 'C2', 'C3', 'C4'])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [8]:
# 데이터프레임 인덱스 설정 및 제거
# 기존의 인덱스는 없어짐 
df2 = df1.set_index('C1')
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [10]:
df2.set_index('C2')
#기존의 인덱스 사라져버림

        C3    C4
C2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07

In [11]:
#reset_index 메서드를 쓰면 기존 인덱스가 자료열 맨 앞으로 삽입됨

df2 = df1.set_index('C1')
df2.reset_index()

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [12]:
#dfop=True 인수 전달하면 인덱스 column을 걍 버림!안살리고
df2 = df1.set_index('C1')
df2.reset_index(drop=True)

     C2    C3    C4
0  0.55  0.65  0.79
1  0.72  0.44  0.53
2   0.6  0.89  0.57
3  0.54  0.96  0.93
4  0.42  0.38  0.07

In [15]:
#결측치가 포함된 행 다 지움
employees.dropna()

    First Name  Gender Start Date    Salary   Mgmt          Team
4        Larry    Male 1998-01-24  101004.0   True            IT
5       Dennis    Male 1987-04-18  115163.0  False         Legal
6         Ruby  Female 1987-08-17   65476.0   True       Product
8       Angela  Female 2005-11-22   95570.0   True   Engineering
9      Frances  Female 2002-08-08  139852.0   True  Business Dev
..         ...     ...        ...       ...    ...           ...
994     George    Male 2013-06-21   98874.0   True     Marketing
996    Phillip    Male 1984-01-31   42392.0  False       Finance
997    Russell    Male 2013-05-20   96914.0  False       Product
998      Larry    Male 2013-04-20   60500.0  False  Business Dev
999     Albert    Male 2012-05-15  129949.0   True         Sales

[761 rows x 6 columns]

In [17]:
employees

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male 1993-08-06       NaN   True     Marketing
1        Thomas    Male 1996-03-31   61933.0   True           NaN
2         Maria  Female        NaT  130590.0  False       Finance
3         Jerry     NaN 2005-03-04  138705.0   True       Finance
4         Larry    Male 1998-01-24  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male 1984-01-31   42392.0  False       Finance
997     Russell    Male 2013-05-20   96914.0  False       Product
998       Larry    Male 2013-04-20   60500.0  False  Business Dev
999      Albert    Male 2012-05-15  129949.0   True         Sales
1000        NaN     NaN        NaT       NaN    NaN           NaN

[1001 rows x 6 columns]

In [20]:
#dropna: row 단위로 drop 되도록 설계되어 있음
#axis = 0이 기본 (row 단위)
employees.dropna(how ='all') # 모두 NaN값인 인덱스 1000 행만 사라짐!

    First Name  Gender Start Date    Salary   Mgmt          Team
0      Douglas    Male 1993-08-06       NaN   True     Marketing
1       Thomas    Male 1996-03-31   61933.0   True           NaN
2        Maria  Female        NaT  130590.0  False       Finance
3        Jerry     NaN 2005-03-04  138705.0   True       Finance
4        Larry    Male 1998-01-24  101004.0   True            IT
..         ...     ...        ...       ...    ...           ...
995      Henry     NaN 2014-11-23  132483.0  False  Distribution
996    Phillip    Male 1984-01-31   42392.0  False       Finance
997    Russell    Male 2013-05-20   96914.0  False       Product
998      Larry    Male 2013-04-20   60500.0  False  Business Dev
999     Albert    Male 2012-05-15  129949.0   True         Sales

[1000 rows x 6 columns]

In [23]:
employees.loc[employees.Gender.isnull()] #Gender에 NaN값이 있는 것만 조회

     First Name Gender Start Date    Salary   Mgmt          Team
3         Jerry    NaN 2005-03-04  138705.0   True       Finance
20         Lois    NaN 1995-04-22   64714.0   True         Legal
22       Joshua    NaN 2012-03-08   90816.0   True            IT
27        Scott    NaN 1991-07-11  122367.0  False         Legal
31        Joyce    NaN 2005-02-20   88657.0  False       Product
...         ...    ...        ...       ...    ...           ...
972      Victor    NaN 2006-07-28   76381.0   True         Sales
985     Stephen    NaN 1983-07-10   85668.0  False         Legal
989      Justin    NaN 1991-02-10   38344.0  False         Legal
995       Henry    NaN 2014-11-23  132483.0  False  Distribution
1000        NaN    NaN        NaT       NaN    NaN           NaN

[147 rows x 6 columns]

In [24]:
employees.dropna(subset = ['Gender']) # Gender가 NaN값인 친구만 지우겠다는 뜻

    First Name  Gender Start Date    Salary   Mgmt          Team
0      Douglas    Male 1993-08-06       NaN   True     Marketing
1       Thomas    Male 1996-03-31   61933.0   True           NaN
2        Maria  Female        NaT  130590.0  False       Finance
4        Larry    Male 1998-01-24  101004.0   True            IT
5       Dennis    Male 1987-04-18  115163.0  False         Legal
..         ...     ...        ...       ...    ...           ...
994     George    Male 2013-06-21   98874.0   True     Marketing
996    Phillip    Male 1984-01-31   42392.0  False       Finance
997    Russell    Male 2013-05-20   96914.0  False       Product
998      Larry    Male 2013-04-20   60500.0  False  Business Dev
999     Albert    Male 2012-05-15  129949.0   True         Sales

[854 rows x 6 columns]

In [27]:
cond1 = employees['Start Date'].isnull()
cond2 = employees['Salary'].isnull()
print(f'cond1: {cond1.sum()} cond2: {cond2.sum()}')

cond1: 2 cond2: 2

In [30]:
#and 연산
employees[cond1 & cond2]

     First Name Gender Start Date  Salary Mgmt Team
1000        NaN    NaN        NaT     NaN  NaN  NaN

In [31]:
#| vertical bar을 통해 or 연산을 함. 둘중 하나라도 True면 True
employees[cond1 |cond2]

     First Name  Gender Start Date    Salary   Mgmt       Team
0       Douglas    Male 1993-08-06       NaN   True  Marketing
2         Maria  Female        NaT  130590.0  False    Finance
1000        NaN     NaN        NaT       NaN    NaN        NaN

In [32]:
#subset 중 하나라도 NaN값이 있으면 탈락.!
employees.dropna(subset = ['Start Date', 'Salary'])

    First Name  Gender Start Date    Salary   Mgmt          Team
1       Thomas    Male 1996-03-31   61933.0   True           NaN
3        Jerry     NaN 2005-03-04  138705.0   True       Finance
4        Larry    Male 1998-01-24  101004.0   True            IT
5       Dennis    Male 1987-04-18  115163.0  False         Legal
6         Ruby  Female 1987-08-17   65476.0   True       Product
..         ...     ...        ...       ...    ...           ...
995      Henry     NaN 2014-11-23  132483.0  False  Distribution
996    Phillip    Male 1984-01-31   42392.0  False       Finance
997    Russell    Male 2013-05-20   96914.0  False       Product
998      Larry    Male 2013-04-20   60500.0  False  Business Dev
999     Albert    Male 2012-05-15  129949.0   True         Sales

[998 rows x 6 columns]

In [33]:
employees[employees.notnull().sum(axis=1) >=4]

    First Name  Gender Start Date    Salary   Mgmt          Team
0      Douglas    Male 1993-08-06       NaN   True     Marketing
1       Thomas    Male 1996-03-31   61933.0   True           NaN
2        Maria  Female        NaT  130590.0  False       Finance
3        Jerry     NaN 2005-03-04  138705.0   True       Finance
4        Larry    Male 1998-01-24  101004.0   True            IT
..         ...     ...        ...       ...    ...           ...
995      Henry     NaN 2014-11-23  132483.0  False  Distribution
996    Phillip    Male 1984-01-31   42392.0  False       Finance
997    Russell    Male 2013-05-20   96914.0  False       Product
998      Larry    Male 2013-04-20   60500.0  False  Business Dev
999     Albert    Male 2012-05-15  129949.0   True         Sales

[985 rows x 6 columns]

In [34]:
employees.notnull()

      First Name  Gender  Start Date  Salary   Mgmt   Team
0           True    True        True   False   True   True
1           True    True        True    True   True  False
2           True    True       False    True   True   True
3           True   False        True    True   True   True
4           True    True        True    True   True   True
...          ...     ...         ...     ...    ...    ...
996         True    True        True    True   True   True
997         True    True        True    True   True   True
998         True    True        True    True   True   True
999         True    True        True    True   True   True
1000       False   False       False   False  False  False

[1001 rows x 6 columns]

In [35]:
employees.Team.duplicated()

0       False
1       False
2       False
3        True
4       False
        ...
996      True
997      True
998      True
999      True
1000     True
Name: Team, Length: 1001, dtype: bool

In [36]:
employees['Team']

0          Marketing
1                NaN
2            Finance
3            Finance
4                 IT
            ...
996          Finance
997          Product
998     Business Dev
999            Sales
1000             NaN
Name: Team, Length: 1001, dtype: object

In [41]:
#마지막에 발견된 값은 False로 반환
"""
duplicated() 메서드는 keep 매개변수에 ‘last’를 전달하면 마지막에 발견된 값에 대해서 
False로 반환하고 앞에 발견된 것에 대해선 True를 반환하게 할 수도 있습니다.
996번 finance
"""
employees['Team'].duplicated(keep='last')

0        True
1        True
2        True
3        True
4        True
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Team, Length: 1001, dtype: bool

In [46]:
# ~ 기호: True를 False로 반전시킴!

first_one_in_Team = ~employees['Team'].duplicated()
employees[first_one_in_Team]

   First Name  Gender Start Date    Salary   Mgmt          Team
0     Douglas    Male 1993-08-06       NaN   True     Marketing
1      Thomas    Male 1996-03-31   61933.0   True           NaN
2       Maria  Female        NaT  130590.0  False       Finance
4       Larry    Male 1998-01-24  101004.0   True            IT
5      Dennis    Male 1987-04-18  115163.0  False         Legal
6        Ruby  Female 1987-08-17   65476.0   True       Product
8      Angela  Female 2005-11-22   95570.0   True   Engineering
9     Frances  Female 2002-08-08  139852.0   True  Business Dev
12    Brandon    Male 1980-12-01  112807.0   True            HR
13       Gary    Male 2008-01-27  109831.0  False         Sales
40    Michael    Male 2008-10-10   99283.0   True  Distribution

In [48]:
employees.drop_duplicates(subset = ['First Name'], keep = False)

    First Name  Gender Start Date    Salary   Mgmt          Team
5       Dennis    Male 1987-04-18  115163.0  False         Legal
8       Angela  Female 2005-11-22   95570.0   True   Engineering
33        Jean  Female 1993-12-18  119082.0  False  Business Dev
190      Carol  Female 1996-03-19   57783.0  False       Finance
291      Tammy  Female 1984-11-11  132839.0   True            IT
495     Eugene    Male 1984-05-24   81077.0  False         Sales
688      Brian    Male 2007-04-07   93901.0   True         Legal
832      Keith    Male 2003-02-12  120672.0  False         Legal
887      David    Male 2009-12-05   92242.0  False         Legal

In [51]:
employees.drop_duplicates(subset = ['Gender', 'Team'])

# dropna는 둘 중 하나면 drop
# duplicates는 둘 다 포함되어야 drop

    First Name  Gender Start Date    Salary   Mgmt          Team
0      Douglas    Male 1993-08-06       NaN   True     Marketing
1       Thomas    Male 1996-03-31   61933.0   True           NaN
2        Maria  Female        NaT  130590.0  False       Finance
3        Jerry     NaN 2005-03-04  138705.0   True       Finance
4        Larry    Male 1998-01-24  101004.0   True            IT
5       Dennis    Male 1987-04-18  115163.0  False         Legal
6         Ruby  Female 1987-08-17   65476.0   True       Product
8       Angela  Female 2005-11-22   95570.0   True   Engineering
9      Frances  Female 2002-08-08  139852.0   True  Business Dev
10      Louise  Female 1980-08-12   63241.0   True           NaN
11       Julie  Female 1997-10-26  102508.0   True         Legal
12     Brandon    Male 1980-12-01  112807.0   True            HR
13        Gary    Male 2008-01-27  109831.0  False         Sales
17       Shawn    Male 1986-12-07  111737.0  False       Product
18       Diana  Female 1981-10-23  132940.0  False            IT
20        Lois     NaN 1995-04-22   64714.0   True         Legal
22      Joshua     NaN 2012-03-08   90816.0   True            IT
31       Joyce     NaN 2005-02-20   88657.0  False       Product
35     Theresa  Female 2006-10-10   85182.0  False         Sales
40     Michael    Male 2008-10-10   99283.0   True  Distribution
41   Christine     NaN 2015-06-28   66582.0   True  Business Dev
43     Marilyn  Female 1980-12-07   73524.0   True     Marketing
46       Bruce    Male 2009-11-28  114796.0  False       Finance
48    Clarence    Male 1996-03-26   93581.0   True  Business Dev
49       Chris     NaN 1980-01-24  113590.0  False         Sales
60       Paula     NaN 2005-11-23   48866.0  False  Distribution
75      Bonnie  Female 1991-07-02  104897.0   True            HR
76    Margaret  Female 1988-09-10  131604.0   True  Distribution
91       James     NaN 2005-01-26  128771.0  False           NaN
97       Laura     NaN 2014-07-19  140371.0   True     Marketing
143     Teresa     NaN 2016-01-28  140013.0   True   Engineering
171    Patrick    Male 2007-08-17  143499.0   True   Engineering
239    Lillian     NaN 2016-05-12   64164.0  False            HR

---

# 텍스트 데이터 다루기

##### 데이터를 정리하는 과정을 랭글링(Wrangling) 또는 먼징(Munging)이라고 한다.

데이터 분석 시 대부분의 시간을 데이터 랭글링에 할애하는 편
텍스트 데이터에 존재하는 불완전성을 개선하는 방법에 대해 살펴보자!텍스트 데이터에 존재하는 불완전성을 개선하는 방법에 대해 살펴보자!

In [53]:
inspections = pd.read_csv('datas/chicago_food_inspections.csv')
inspections

                                      Name             Risk
0               MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                              JETS PIZZA   Risk 2 (Medium)
2                               ROOM 1520      Risk 3 (Low)
3                MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                            CHARTWELLS       Risk 1 (High)
...                                    ...              ...
153805                         WOLCOTT'S      Risk 1 (High)
153806     DUNKIN DONUTS/BASKIN-ROBBINS     Risk 2 (Medium)
153807                           Cafe 608     Risk 1 (High)
153808                        mr.daniel's     Risk 1 (High)
153809                         TEMPO CAFE     Risk 1 (High)

[153810 rows x 2 columns]

In [55]:
inspections['Name'].head().values

#띄어쓰기가 중구난방 :)

array([' MARRIOT MARQUIS CHICAGO   ', ' JETS PIZZA ', '   ROOM 1520 ',
       '  MARRIOT MARQUIS CHICAGO  ', ' CHARTWELLS   '], dtype=object)

In [58]:
inspections['Name'].str #문자열처럼 다루고 싶어요
#문자열 처리 메서드를 사용할 수 있게 됨!

In [59]:
dessert = '  cheesecake  '
dessert.lstrip()  #왼쪽 공백제거

'cheesecake  '

In [60]:
dessert.rstrip() #오른쪽 공백 제거

'  cheesecake'

In [61]:
dessert.strip() #공백 제거

'cheesecake'

#### 양옆을 지워줌!! 중간은 상관 없다

In [62]:
dessert = '  cheese cake  '
dessert.strip()

'cheese cake'

In [64]:
inspections['Name'].str.strip().head(3)

0    MARRIOT MARQUIS CHICAGO
1                 JETS PIZZA
2                  ROOM 1520
Name: Name, dtype: object

In [69]:
inspections['Name'] = inspections['Name'].str.strip()
inspections #깔끔합니다!

                                Name             Risk
0            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
1                         JETS PIZZA  Risk 2 (Medium)
2                          ROOM 1520     Risk 3 (Low)
3            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
4                         CHARTWELLS    Risk 1 (High)
...                              ...              ...
153805                     WOLCOTT'S    Risk 1 (High)
153806  DUNKIN DONUTS/BASKIN-ROBBINS  Risk 2 (Medium)
153807                      Cafe 608    Risk 1 (High)
153808                   mr.daniel's    Risk 1 (High)
153809                    TEMPO CAFE    Risk 1 (High)

[153810 rows x 2 columns]

In [70]:
inspections.columns

Index(['Name', 'Risk'], dtype='object')

In [71]:
for column in inspections.columns:
    inspections[column] = inspections[column].str.strip()

In [72]:
inspections

                                Name             Risk
0            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
1                         JETS PIZZA  Risk 2 (Medium)
2                          ROOM 1520     Risk 3 (Low)
3            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
4                         CHARTWELLS    Risk 1 (High)
...                              ...              ...
153805                     WOLCOTT'S    Risk 1 (High)
153806  DUNKIN DONUTS/BASKIN-ROBBINS  Risk 2 (Medium)
153807                      Cafe 608    Risk 1 (High)
153808                   mr.daniel's    Risk 1 (High)
153809                    TEMPO CAFE    Risk 1 (High)

[153810 rows x 2 columns]

In [73]:
ord('A')

65

In [74]:
bin(ord('A'))

'0b1000001'

In [75]:
bin(ord('a'))

'0b1100001'

#### lower() 모두 소문자로, upper() 모두 대문자로

In [76]:
inspections = inspections.dropna(subset = ['Risk'])

In [82]:
inspections['Risk'].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All'],
      dtype=object)

#### capitalize() 첫문자만 대문자로, title 단어마다 첫글자만 대문자로

In [83]:
inspections['Name'].str.capitalize().head()

0    Marriot marquis chicago
1                 Jets pizza
2                  Room 1520
3    Marriot marquis chicago
4                 Chartwells
Name: Name, dtype: object

In [84]:
inspections['Name'].str.title().head()

0    Marriot Marquis Chicago
1                 Jets Pizza
2                  Room 1520
3    Marriot Marquis Chicago
4                 Chartwells
Name: Name, dtype: object

#### replace() 메서드로 값 치환하기

In [119]:
ins = inspections

In [121]:
ins = ins.replace(
    to_replace = 'All', value = 'Risk 4 (Extreme)'
)

In [122]:
ins['Risk'].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)',
       'Risk 4 (Extreme)'], dtype=object)

In [112]:
ins = ins.dropna(subset = ['Risk'])
inspections['Risk'].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All'],
      dtype=object)

---

문자열 인덱싱

Risk 1 (High) <br>
Risk 2 (Medium) <br>
Risk 3 (Low) <br>
Risk 4 (Extreme) <br>
_____^여기!

In [113]:
ins['Risk'].str[5].astype('i').head()

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: int32

In [114]:
ins['Risk'].str[8:-1].astype('category').head()
                      #category로 type 변경
# 앞에서 8번째부터 Risk 1 (까지
# 뒤에서 1번째까지 )제외

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: category
Categories (4, object): ['Extreme', 'High', 'Low', 'Medium']

In [115]:
ins['Risk'].str[8:-1].astype('category').value_counts()

High       107351
Medium      31845
Low         14529
Extreme        19
Name: Risk, dtype: int64

In [116]:
%%time 
has_pizza = ins['Name'].str.lower().str.contains('pizza')
inspections[has_pizza]

Wall time: 99.9 ms

                                    Name             Risk
1                             JETS PIZZA  Risk 2 (Medium)
19         NANCY'S HOME OF STUFFED PIZZA    Risk 1 (High)
27            NARY'S GRILL & PIZZA ,INC.    Risk 1 (High)
29                   NARYS GRILL & PIZZA    Risk 1 (High)
68                         COLUTAS PIZZA    Risk 1 (High)
...                                  ...              ...
153756       ANGELO'S STUFFED PIZZA CORP    Risk 1 (High)
153764                COCHIAROS PIZZA #2    Risk 1 (High)
153772  FERNANDO'S MEXICAN GRILL & PIZZA    Risk 1 (High)
153788            REGGIO'S PIZZA EXPRESS    Risk 1 (High)
153801        State Street Pizza Company    Risk 1 (High)

[3992 rows x 2 columns]

In [123]:
ins['Risk degree'] = ins.Risk.str[8:-1].astype('category')
ins.Risk = ins.Risk.str[5].astype('i')
ins

                                Name  Risk Risk degree
0            MARRIOT MARQUIS CHICAGO     1        High
1                         JETS PIZZA     2      Medium
2                          ROOM 1520     3         Low
3            MARRIOT MARQUIS CHICAGO     1        High
4                         CHARTWELLS     1        High
...                              ...   ...         ...
153805                     WOLCOTT'S     1        High
153806  DUNKIN DONUTS/BASKIN-ROBBINS     2      Medium
153807                      Cafe 608     1        High
153808                   mr.daniel's     1        High
153809                    TEMPO CAFE     1        High

[153744 rows x 3 columns]

### 다중 인덱스

In [125]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                   columns = [['A', 'A', 'B', 'B'],
                              ['C1', 'C2', 'C1', 'C2']])
df3

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [126]:
df3.columns.names = ['Cidx1', 'Cidx2']
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [129]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns = [['A', 'A', 'B', 'B'],
                              ['C1', 'C2', 'C1', 'C2']],
                   index = [['M', 'M', 'M','F', 'F', 'F'],
                            ['id_'+ str(i+1) for i in range(3)] *2])
df4.columns.names = ['Cidx1', 'Cidx2']
df4.index.names= ['Ridx1', 'Ridx2']

df4

Cidx1           A           B
Cidx2          C1    C2    C1    C2
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [130]:
df4.stack('Cidx1')

Cidx2                C1    C2
Ridx1 Ridx2 Cidx1
M     id_1  A      1.76  0.40
            B      0.98  2.24
      id_2  A      1.87 -0.98
            B      0.95 -0.15
      id_3  A     -0.10  0.41
            B      0.14  1.45
F     id_1  A      0.76  0.12
            B      0.44  0.33
      id_2  A      1.49 -0.21
            B      0.31 -0.85
      id_3  A     -2.55  0.65
            B      0.86 -0.74

In [132]:
df4.unstack('Ridx2')

Cidx1     A                                   B
Cidx2    C1                C2                C1                C2
Ridx2  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3
Ridx1
F      0.76  1.49 -2.55  0.12 -0.21  0.65  0.44  0.31  0.86  0.33 -0.85 -0.74
M      1.76  1.87 -0.10  0.40 -0.98  0.41  0.98  0.95  0.14  2.24 -0.15  1.45

In [136]:
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [135]:
#튜플로 인덱싱 해야 함
df3[('B','C1')]

0    0.98
1    0.95
2    0.14
3    0.44
4    0.31
Name: (B, C1), dtype: float64

In [137]:
df3.loc[0, ('B','C1')] = 100  #값 변경
df3

Cidx1     A             B
Cidx2    C1    C2      C1    C2
0      1.76  0.40  100.00  2.24
1      1.87 -0.98    0.95 -0.15
2     -0.10  0.41    0.14  1.45
3      0.76  0.12    0.44  0.33
4      1.49 -0.21    0.31 -0.85

In [140]:
df3.iloc[0,2] #다중 인덱스는 안 써도됨 iloc

100.0

In [141]:
df3['A']

Cidx2    C1    C2
0      1.76  0.40
1      1.87 -0.98
2     -0.10  0.41
3      0.76  0.12
4      1.49 -0.21

In [148]:
df4.loc['M'] #index 슬라이싱

Cidx1     A           B
Cidx2    C1    C2    C1    C2
Ridx2
id_1   1.76  0.40  0.98  2.24
id_2   1.87 -0.98  0.95 -0.15
id_3  -0.10  0.41  0.14  1.45

In [149]:
df4[('A','C1')] #column 범위 슬라이싱

Ridx1  Ridx2
M      id_1     1.76
       id_2     1.87
       id_3    -0.10
F      id_1     0.76
       id_2     1.49
       id_3    -2.55
Name: (A, C1), dtype: float64

In [151]:
df4.loc[(slice(None), 'id_1'), : ]

Cidx1           A           B
Cidx2          C1    C2    C1    C2
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
F     id_1   0.76  0.12  0.44  0.33

In [154]:
# 인덱스 순서를 바꾸고 싶을 때
# swaplevel(i, j, axis) i와 j는 교환하고자 하는 인덱스 label/인덱스 번호이고
# axis는 0일 때 row 인덱스, 1일 때 column 인덱스를 뜻함 디폴트는 행 인덱스

df6 = df4.swaplevel('Cidx1', 'Cidx2', 1)
df6

Cidx2          C1    C2    C1    C2
Cidx1           A     A     B     B
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [156]:
df5 = df4.swaplevel('Ridx1', 'RidX2',1)

KeyError: 'Level Ridx1 not found'

In [155]:
df6.sort_index(axis=1, level=0)

Cidx2          C1          C2
Cidx1           A     B     A     B
Ridx1 Ridx2
M     id_1   1.76  0.98  0.40  2.24
      id_2   1.87  0.95 -0.98 -0.15
      id_3  -0.10  0.14  0.41  1.45
F     id_1   0.76  0.44  0.12  0.33
      id_2   1.49  0.31 -0.21 -0.85
      id_3  -2.55  0.86  0.65 -0.74

merge() 함수

In [159]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': list('둘도또길희마영')
}, columns = ['고객번호', '이름'])
df1

   고객번호 이름
0  1001  둘
1  1002  도
2  1003  또
3  1004  길
4  1005  희
5  1006  마
6  1007  영

In [160]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [163]:
pd.merge(df1, df2) #알아서 머지해줌
#양쪽에 모두 키가 존재하는 데이터만 보여주는 inner join 방식 사용

   고객번호 이름     금액
0  1001  둘  10000
1  1001  둘  20000
2  1001  둘  30000
3  1005  희  15000
4  1006  마   5000

In [164]:
#outer join 시키기
pd.merge(df1, df2, how='outer')

   고객번호   이름        금액
0  1001    둘   10000.0
1  1001    둘   20000.0
2  1001    둘   30000.0
3  1002    도       NaN
4  1003    또       NaN
5  1004    길       NaN
6  1005    희   15000.0
7  1006    마    5000.0
8  1007    영       NaN
9  1008  NaN  100000.0

In [168]:
pd.merge(df1, df2, how='left')
# # dhfmsWHrdfm rlwnsdfh dhlsWHr dkdldff RKREK"
# 오른쪽을 기준으로 왼쪽 부분을 기존에 대입

   고객번호 이름       금액
0  1001  둘  10000.0
1  1001  둘  20000.0
2  1001  둘  30000.0
3  1002  도      NaN
4  1003  또      NaN
5  1004  길      NaN
6  1005  희  15000.0
7  1006  마   5000.0
8  1007  영      NaN

### ...졸았다...

In [169]:
#dataFrame 그룹 연산 메서드
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1':[1,2,3,4,5],
    'data2':[10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [170]:
#그룹 연산 메서드
#그룹 A와 B로 구분한 그룹 데이터를 만든다

groups = df2.groupby(df2.key1)
groups

In [171]:
groups.groups

{'A': [0, 1, 4], 'B': [2, 3]}

In [173]:
groups.sum() #key1을 기준으로 인덱스별로 더해줌

      data1  data2
key1
A         8     80
B         7     70

In [181]:
df2.data1.groupby(df2.key1).sum()

df2.groupby(df2.key1)['data1'].sum()

df2.groupby(df2.key1).sum()['data1']

key1
A    8
B    7
Name: data1, dtype: int64

In [182]:
df2.data1.groupby([df2.key1, df2.key2]).sum()

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [183]:
pd.date_range(start='2018-4-1',periods=30)

DatetimeIndex(['2018-04-01', '2018-04-02', '2018-04-03', '2018-04-04',
               '2018-04-05', '2018-04-06', '2018-04-07', '2018-04-08',
               '2018-04-09', '2018-04-10', '2018-04-11', '2018-04-12',
               '2018-04-13', '2018-04-14', '2018-04-15', '2018-04-16',
               '2018-04-17', '2018-04-18', '2018-04-19', '2018-04-20',
               '2018-04-21', '2018-04-22', '2018-04-23', '2018-04-24',
               '2018-04-25', '2018-04-26', '2018-04-27', '2018-04-28',
               '2018-04-29', '2018-04-30'],
              dtype='datetime64[ns]', freq='D')

In [184]:
np.random.seed(0)
ts = pd.Series(np.random.randn(4), index=pd.date_range(
    '2018-1-1', periods=4, freq='M'))
ts

2018-01-31    1.764052
2018-02-28    0.400157
2018-03-31    0.978738
2018-04-30    2.240893
Freq: M, dtype: float64

In [188]:
ts.shift(1) # 하나씩 밀렸음, 밀려쓰기, 옮기기

2018-01-31         NaN
2018-02-28    1.764052
2018-03-31    0.400157
2018-04-30    0.978738
Freq: M, dtype: float64

In [189]:
#반대로 밀려쓰기
ts.shift(-1)

2018-01-31    0.400157
2018-02-28    0.978738
2018-03-31    2.240893
2018-04-30         NaN
Freq: M, dtype: float64

In [191]:
ts.shift(1, freq='M') #날짜를 미뤄요

2018-02-28    1.764052
2018-03-31    0.400157
2018-04-30    0.978738
2018-05-31    2.240893
Freq: M, dtype: float64

In [193]:
ts.shift(1, freq='W') #주단위로 미뤄요

2018-02-04    1.764052
2018-03-04    0.400157
2018-04-01    0.978738
2018-05-06    2.240893
dtype: float64

In [195]:
s = pd.Series(pd.date_range('2020-12-25', periods=100, freq='D'))

In [198]:
"""
formatting 하는 방법
https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior
"""
s.dt.strftime('%Y년 %m월 %d일')

0     2020년 12월 25일
1     2020년 12월 26일
2     2020년 12월 27일
3     2020년 12월 28일
4     2020년 12월 29일
          ...
95    2021년 03월 30일
96    2021년 03월 31일
97    2021년 04월 01일
98    2021년 04월 02일
99    2021년 04월 03일
Length: 100, dtype: object

In [200]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [206]:
def change_boolean(value):
    if value == 'yes':
        return True
    else:
        return False
    
titanic.alive.apply(change_boolean)

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: alive, Length: 891, dtype: bool